# Selecionando colunas e filtrando linhas

### Selecionando colunas

In [2]:
import pandas as pd

data = {'Nome': ['Adriano', 'Rodrigo', 'Juliano', 'Mateus', 'Luiza', 'Rodrigo', 'Ayres', 'Aninha'],
		'Sobrenome': ['Soares', 'Tadewald', 'Faccioni', 'Kienzle', 'Cherobini', 'Vanzelotti', 'Júnior', 'Tadewald'],
		'Idade Atual': [31, 31, 25, 35, 22, 21, 28, 20],
		}

df = pd.DataFrame(data)
df.Sobrenome

0        Soares
1      Tadewald
2      Faccioni
3       Kienzle
4     Cherobini
5    Vanzelotti
6        Júnior
7      Tadewald
Name: Sobrenome, dtype: object

In [3]:
df[['Sobrenome', 'Idade Atual']]

    Sobrenome  Idade Atual
0      Soares           31
1    Tadewald           31
2    Faccioni           25
3     Kienzle           35
4   Cherobini           22
5  Vanzelotti           21
6      Júnior           28
7    Tadewald           20

In [4]:
type(df[['Sobrenome', 'Idade Atual']])

pandas.core.frame.DataFrame

In [6]:
type(df[['Sobrenome']])

pandas.core.frame.DataFrame

In [7]:
type(df['Sobrenome'])

pandas.core.series.Series

In [8]:
df[[col for col in df.columns if not col in ['Sobrenome']]]# todas as colunas menos as colunas do conjunto ['Sobrenome']

      Nome  Idade Atual
0  Adriano           31
1  Rodrigo           31
2  Juliano           25
3   Mateus           35
4    Luiza           22
5  Rodrigo           21
6    Ayres           28
7   Aninha           20

In [9]:
df[[col for col in df.columns if not col in ['Sobrenome',"Nome"]]]# todas as colunas menos as colunas do conjunto ['Sobrenome']

   Idade Atual
0           31
1           31
2           25
3           35
4           22
5           21
6           28
7           20

### Filtrando por indexação (.iloc)

In [10]:
df.iloc[1:3] #seleção da linha 1 ate a 3

      Nome Sobrenome  Idade Atual
1  Rodrigo  Tadewald           31
2  Juliano  Faccioni           25

In [9]:
df.iloc[1:3, :2]#seleção da linha 1 ate a 3

      Nome Sobrenome
1  Rodrigo  Tadewald
2  Juliano  Faccioni

In [11]:
df.iloc[3:, 0]

3     Mateus
4      Luiza
5    Rodrigo
6      Ayres
7     Aninha
Name: Nome, dtype: object

In [12]:
df.iloc[3:, 0:2]

      Nome   Sobrenome
3   Mateus     Kienzle
4    Luiza   Cherobini
5  Rodrigo  Vanzelotti
6    Ayres      Júnior
7   Aninha    Tadewald

### Filtrando por condições  (.loc)

In [13]:
df['Nome'] == 'Rodrigo'

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: Nome, dtype: bool

In [11]:
df[df['Nome'] == 'Rodrigo']

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
5  Rodrigo  Vanzelotti           21

In [12]:
df.loc[df['Nome'] == 'Rodrigo']

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
5  Rodrigo  Vanzelotti           21

In [13]:
df.loc[df['Nome'] == 'Rodrigo', 'Sobrenome']

1      Tadewald
5    Vanzelotti
Name: Sobrenome, dtype: object

### Filtrando por múltiplas condições  (.loc)

In [16]:
df.loc[(df['Nome'] == 'Rodrigo') & (df['Idade Atual'] < 30)]

      Nome   Sobrenome  Idade Atual
5  Rodrigo  Vanzelotti           21

### Filtrando por lista de valores  (.isin)

In [18]:
nomes_filtro = ['Adriano', 'Luiza']

df.loc[df['Nome'].isin(nomes_filtro)]

      Nome  Sobrenome  Idade Atual
0  Adriano     Soares           31
4    Luiza  Cherobini           22

In [19]:
df['Nome'].str.contains("Adriano")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: Nome, dtype: bool

In [20]:
df.loc[df['Nome'].str.contains("Adriano")]

      Nome Sobrenome  Idade Atual
0  Adriano    Soares           31